load-testing/scenarios/api-rampup-scenarios.yml
config:
  target: 'http://localhost:4000'
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - duration: 120
      arrivalRate: 5
      name: 'Warm up'
    - pause: 10
    - duration: 120
      arrivalRate: 10
      name: 'More load'
    - pause: 10
    - duration: 120
      arrivalRate: 25
      name: 'More load'
before:
  flow:
    - log: 'Get JWT token'
    - post:
        url: '/login'
        json:
          login: 'admin'
          password: 'admin'
        capture:
          - json: $.token
            as: token
    - log: 'Got JWT token {{ token }}'
scenarios:
  - name: "Test all user's endpoints"
    flow:
      - log: 'Get all users'
      - get:
          url: '/users'
          headers:
            authorization: 'Bearer {{ token }}'
      - log: 'Create new user'
      - post:
          url: '/users'
          json:
            name: 'test_name'
            login: 'test_user_{{ $randomString() }}_{{ $randomNumber(1,10000) }}'
            password: 'test_password'
          headers:
            authorization: 'Bearer {{ token }}'
          capture:
            - json: $.id
              as: user_id
      - log: 'Get user with id {{ user_id }}'
      - get:
          url: '/users/{{ user_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
      - log: 'Update user with id {{ user_id }}'
      - put:
          url: '/users/{{ user_id }}'
          json:
            name: 'test_name_updated'
            password: 'test_password_updated'
          headers:
            authorization: 'Bearer {{ token }}'
      - log: 'Delete user with id {{ user_id }}'
      - delete:
          url: '/users/{{ user_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
      - log: 'User with id {{ user_id }} deleted'